// Задание 2. (5.3-2)

// Дана переменная x, которая может принимать любое значение. Написать программу, которая в зависимости от типа данных x выводит в консоль сообщение вида: «x — число».
// Опишите три случая: когда х = числу, строке или логическому типу. В других случаях выводите сообщение: «Тип x не определён».
// Примечание: в этом задании использовать promt не нужно.

let x;
x = NaN;
if (typeof(x) === 'number' && isNaN(x) == false) {
    console.log("x — число");
} else if (typeof(x) == 'string') {
    console.log("x — строка");  
} else if (typeof(x) == 'boolean') {
    console.log("x — логический тип");  
} else {
    console.log("Тип x не определён");  
}